# TagId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiReferenceAnnotation..::..TagId Property
MultiReferenceAnnotation Class See Also
---
The child IndependentTag owned by this multi-reference annotation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId TagId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TagId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ TagId {
	ElementId^ get ();
}
```

# See Also
MultiReferenceAnnotation Class
Autodesk.Revit.DB Namespace